# -*- eval: (progn (org-babel-goto-named-src-block "starting_block") (org-babel-execute-src-block) (outline-hide-sublevels 1)); -*-

#+PROPERTY: header-args:ipython :eval never :session ktestable
#+TITLE: Learning union of k-testable languages
#+subtitle: Statistical and symbolic language modeling project
#+AUTHOR: Rania el Bouhssini, Martin Laville and Félix Jamet

** Tests

We make some tests to ensure that the implementation works at least superficially as intended:

#+BEGIN_SRC ipython :eval no-export :results output :exports both :wrap example
tests = {
    'invalid example': ({'aa'}, {'aa'}, {'aaaa'}, {'ada'}),
    'aa+': ktest_tuple('aaa', 3),
    'bb+': ktest_tuple('bbb', 3)
}
instanciations = {}

for name, parameters in tests.items():
    try:
        ktest = ktestable(*parameters)
        print('The creation of "%s": %s went well' % (name, parameters))
        instanciations[name] = ktest
    except ValueError as e:
        print('The creation of "%s": %s failed:\n -' % (name, parameters), e)


union = instanciations['aa+'] | instanciations['bb+']
intersection = instanciations['aa+'] & instanciations['bb+']
symmetric_difference = instanciations['aa+'] ^ instanciations['bb+']

print(union.prefixes)
print(intersection.prefixes)
print(symmetric_difference.prefixes)

print(union.distance(union))
print(union.distance(intersection))
print(len(union), len(intersection))
#+END_SRC

#+RESULTS:
#+BEGIN_example
The creation of "invalid example": ({'aa'}, {'aa'}, {'aaaa'}, {'ada'}) failed:
 - Incorrect prefix length, incorrect suffix length, short strings conditions not satisfied.
The creation of "aa+": ({'aa'}, {'aa'}, {'aaa'}, {'aa'}) went well
The creation of "bb+": ({'bb'}, {'bb'}, {'bbb'}, {'bb'}) went well
{'bb', 'aa'}
set()
{'aa', 'bb'}
0
6
6 0
#+END_example

*** Updating the distance chain
Finally, we construct the distance link corresponding to the \(k\)-test union that was just created all the while making sure that the distance chain is still sorted.
It would be more efficient to simply insert the new distance link at its place in the distant chain rather than sorting the list all over again, but we wanted to put the emphasis on readability.

#+name: Update distance chain
#+BEGIN_SRC ipython
neighbours = []
for right, merged in enumerate(already_merged[:-1]):
    if not merged:
        neighbours.append((ktest_vectors[-1].distance(ktest_vectors[right]), right))

neighbours.sort()
distance_chain.append(distance_link(neighbours=neighbours, left=len(ktest_vectors) - 1))
distance_chain.sort()
#+END_SRC

#+begin_src ipython :eval no-export :results output :noweb yes :exports none
try:
    <<learnktest>>
except Exception as e:
    import traceback
    import sys
    traceback.print_exc(file=sys.stdout)
#+end_src

#+RESULTS:
:RESULTS:
[(<__main__.ktestable object at 0x7f33996f2588>, 0), (<__main__.ktestable object at 0x7f3391a9e2e8>, 7), (<__main__.ktestable object at 0x7f339a0c9710>, ((1, 4), 6)), (<__main__.ktestable object at 0x7f339a0c92b0>, ((3, 5), 2))]
:END:

** Tests
:PROPERTIES:
:header-args:ipython: :tangle tangled_test.py :session ktestable
:END:

#+name: ktestable class extension
#+BEGIN_SRC ipython :exports none :noweb yes :eval no-export :results silent :tangle tangled_ktestable.py
from collections import namedtuple
import networkx as nx

<<ktestable class>>

    <<Construct consistency graph>>

    <<Union consistency>>

<<Distance chain learning>>
#+END_SRC

#+BEGIN_SRC ipython :exports none
from tangled_ktestable import ktestable, learn_ktest_union
#+END_SRC


Some basic tests based on examples from the paper.

#+name: Union consistency test
#+BEGIN_SRC ipython :exports both :eval no-export :results output :wrap example :noweb yes
examples = {
    'z3': ({'ab'}, {'bc'}, {'abc', 'bca', 'cab'}, {}),
    'z4': ({'cb'}, {'ba'}, {'cba', 'bac', 'acb'}, {}),
    'z5': ({'ab'}, {'ba'}, {'abb', 'bbb', 'bba'}, {}),
    'z7': ({'ab'}, {'ba'}, {'abb', 'bbb', 'bba'}, {}),
}

instances = {iden: ktestable(*params) for iden, params in examples.items()}

print(instances['z5'].is_union_consistent_with(instances['z7']))
print(instances['z3'].is_union_consistent_with(instances['z4']))
print(instances['z3'].is_union_consistent_with(instances['z7']))

print()
print(ktestable.from_example('baba', 3).is_union_consistent_with(ktestable.from_example('babababc', 3)))

with open('dataset/paper.txt') as datasetfile:
    dataset = [line.rstrip('\n') for line in datasetfile]

res = learn_ktest_union(dataset, 3)
clusters = list(map(lambda x: x[1], res))
print(clusters)
print(len(clusters))
#+END_SRC

#+RESULTS: Union consistency test
#+BEGIN_example
True
True
False

True
7
6
5
4
4
2
[((4, 6), 1), (0, 7), ((3, 5), 2)]
3
#+END_example

**Improving and/or simplifying proposition 4

In proposition 4, having to build a consistency graph and find a path in it between a red and a blue vertices seems like a not really effective way to find if the union of two k-testables languages is consistent or not.
So we thought of some ways to make some case easier to deal with :
    Let's take two k-testables languages Z and Z' defined by I, F and T and I', F' and T' as explained in 2.1.
    If T∩T' is empty then the union is not safe if :
        -A prefix (size k-1) of an element of T is equal to a suffix (size k-1) of an element of T'
        OR
        -A suffix (size k-1) of an element of T is equal to a prefix (size k-1) of an element of T'
    Else
        If I∩I' and F∩F' are both empty, the union is not safe.
        Else build the consistency graph and find a path as explained in proposition 4.

Saying X∩X' is empty means every element of X and X' are not white vertices.
If T∩T' is empty, that means there is no white vertices as presented in proposition 4. So every equality between a prefix of T and a suffix of T' is like a path between a red and a blue vertex from proposition 4.
If T∩T' is not empty, we check I∩I' and F∩F'. If they are both empy, that means there is a path who go from a blue or red suffixe to a white infixe and which can't end with only white vertices and will have a way to end in F or F' because a white vertex is basically a bridge between Z and Z'. So there is a path between a red and blue vertex.

This seem easier to calculate and explain, and there might be a way to improve the part where T∩T' is empty if we check what is in I and F.

